
## Plan Result (client-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/35394)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod:391" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ClientAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "PORT"
                            value = "4001"
                        },
                      ~ {
                            name  = "RELEASE_SHA"
                          ~ value = "6578e34e346987ed0d96f9fbd89bf8d97ca06902" -> "2cc364b6c45bdd13c5777e5ff36e1866d1a9136a"
                        },
                    ]
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/clientapi-prod-app:6578e34e346987ed0d96f9fbd89bf8d97ca06902" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/clientapi-prod-app:2cc364b6c45bdd13c5777e5ff36e1866d1a9136a"
                    name                   = "app"
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ClientAPI-Prod" -> (known after apply)
      ~ revision                 = 391 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ClientAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"f6986cdf-b3c8-4cca-91a2-68fb62f3d77d","JobName":"client-api_infrastructure_plan_prod","PRNumber":144,"Program":"tfcmt","SHA1":"2cc364b6c45bdd13c5777e5ff36e1866d1a9136a","Target":"client-api-cdk","Vars":{}} -->